package me.drkapdor.funbazeapi.api.user.attachment.roleplay;

import java.util.Random;

/**
 * Ролевые фамилия и имя персонажа
 * @author DrKapdor
 */

public class UserName {

    private String first;
    private String second;

    public UserName() {
        first = NAMES[new Random().nextInt(NAMES.length)];
        second = SURNAMES[new Random().nextInt(SURNAMES.length)];
    }

    /**
     * Конструктор ролевого имени персонажа
     *
     * @param first Имя персонажа
     * @param second Фамилия персонажа
     */

    public UserName(String first, String second) {
        this.first = first.toUpperCase().charAt(0) + first.substring(1).toLowerCase();
        this.second = second.toUpperCase().charAt(0) + second.substring(1).toLowerCase();;
    }

    /**
     * Возвращает имя персонажа
     * @return Имя
     */

    public String asFirst() {
        return first;
    }

    /**
     * Возвращает фамилию персонажа
     * @return Фамилия
     */

    public String asSecond() {
        return second;
    }

    /**
     * Устанавливает имя персонажа
     * @param name Имя
     */

    public void setFirst(String name) {
        this.first = name;
    }

    /**
     * Устанавливает фамилию персонажа
     * @param second Фамилия
     */

    public void setSecond(String second) {
        this.second = second;
    }

    /**
     * Возвращает имя и фамилию персонажа, разделённые пробелом
     * @return Разделённые пробелом фамилия и имя персонажа
     */

    public String asFull() {
        return first + " " + second;
    }

    @Override
    public String toString() {
        return asFull();
    }

    private static final String[] NAMES = {
            "Павел",
            "Евгений",
            "Дмитрий",
            "Владимир" ,
            "Максим",
            "Александр",
            "Даниил",
            "Арсений",
            "Григорий" ,
            "Борис",
            "Алексей",
            "Никита",
            "Михаил",
            "Анатолий",
            "Валерий",
            "Николай",
            "Артём",
            "Станислав",
            "Ярослав",
            "Егор",
            "Игорь",
            "Руслан",
            "Тимофей",
            "Матвей",
            "Юрий",
            "Родион",
            "Захар",
            "Сергей",
            "Савелий",
            "Виталий",
            "Виктор",
            "Константин",
            "Тимур",
            "Степан",
            "Григорий",
            "Дементий",
            "Климент",
            "Богдан"
    };

    private static final String[] SURNAMES = {
            "Никифоров",
            "Данилюк",
            "Васильев",
            "Карпов",
            "Дмитриев",
            "Беризовский",
            "Стерлигов",
            "Юлин",
            "Пучков",
            "Панкратов",
            "Мясников",
            "Стогов",
            "Дубровский",
            "Ярошенко",
            "Калашников",
            "Сахарович",
            "Макаров",
            "Столяров",
            "Чапаев",
            "Кулаков",
            "Григорович",
            "Ющин",
            "Усольцев",
            "Уфимцев",
            "Ветров",
            "Буйный",
            "Боровой",
            "Николаев",
            "Халецкий",
            "Панченко",
            "Мармеладов",
            "Полянский",
            "Стоцкий",
            "Потрошенко",
            "Фёдоров",
            "Квачков",
            "Лимонов",
            "Громов",
            "Медведев",
            "Кабанов",
            "Фомин",
            "Прохоров",
            "Колобков",
            "Каневский",
            "Парасюх",
            "Хворостюк",
            "Яровой",
            "Чернов",
            "Жаров",
            "Ивашков",
            "Лебедев",
            "Гусев",
            "Рукин",
            "Машков",
            "Яшин",
            "Весельчак",
            "Харитонов",
            "Чацкий",
            "Чупряков",
            "Живой",
            "Дуров",
            "Алтуфьев",
            "Астафьев",
            "Остапенко",
            "Прокопенко",
            "Фистовский",
            "Колыванов",
            "Климов",
            "Колесников",
            "Кириенко",
            "Довольный",
            "Наумов",
            "Абрамов",
            "Богомазов",
            "Циничный",
            "Синицын",
            "Штольц",
            "Шульц",
            "Ягер",
            "Доронин",
            "Воронин",
            "Щукин",
            "Журов",
            "Задорный",
            "Бровин",
            "Дугин",
            "Чепуха",
            "Капитонов",
            "Острый",
            "Шушкшин",
            "Шапошников",
            "Сапожников",
            "Барашков",
            "Тодоров"
    };
}
